export const blog: string[] = [
	"Всё началось в 2020 году - тогда я прошёл пару небольших заданий по <b>Python</b> на платформе <i>Учи.ру</i> и меня всерьёз заинтересовали как этот язык программирования, так и программирование в целом.",
	"В том же году я начал проходить курс по <b>Python</b> от онлайн-школы <i>itland.online</i>. Я изучил основы, ООП и пару простеньких библиотек, однако сам курс так до конца и не закончил. В какой то момент мне надоело программирование и я его полностью забросил.",
	"Вместо программирования я начал интересоваться <em>3д моделированием</em> - по началу я создавал простенькие локации и персонажей в <b>Magica Voxel</b>, а позже освоил <b>Blender</b>.",
	"И вот спустя ещё некоторое время мне надоело 3д моделирование. Я решил вернуться к программированию и начал изучать, какие языки программирования сейчас популярны и для чего они используются. Так я узнал сначала про <b>JavaScript</b>, а потом и про такое направление, как <span>web-разработка</span>. Я начал учиться писать простенькие сайты на <b>HTML</b> и <b>CSS</b> по мини-курсам на <i>YouTube</i>.",
	'Через пару недель после этого я совершенно случайно узнал о проекте <span>"Код будущего"</span> и решил углубиться в web-разработку. В октябре 2022 года я поступил на курс <span>"Fullstack-разработчик: от собственного сайта до полноценного веб-приложения"</span>',
	"За этот курс я более подробно изучил <b>HTML</b> и <b>CSS</b>, познакомился с <b>Bootstrap</b>, научился кодить на <b>JavaScript</b>. Потом познакомился с <b>Node.JS</b>, <b>Express</b> и <b>MongoDB</b>. Ещё чуть позже узнал про <em>SPA</em>. Сначала узнал про шаблонизаторы и научился работать с <b>Handlebars</b>, потом узнал про <b>Vue (Options API)</b>.",
	"В июне 2023 я закончил курс и получил <b>сертификат</b>. С тех пор я активно изучаю новые фреймворки и библиотеки, а так же создаю всё более сложные и интересные проекты.",
	"В марте 2025 я стал <b>призёром III степени</b> олимпиады по промышленной разработке <b>PROD</b> (по треку Front-end).",
	"С <i>июля 2025</i> года по <i>сентябрь 2025</i> года занимал должность <b>Backend-разработчика на TypeScript</b> в <i>Millida</i>.",
	'С сентября 2025 года я студент в <b>ПетрГУ</b> по направлению <b>"Информатика и вычислительная техника"</b>, профиль <b>"Проектирование информационных систем в экономике"</b>.'
]
